# Assesment1

In [ ]:
# 1) Import pandas and read in the banklist.csv file into a dataframe called banks. 
import pandas as pd
bank = pd.read_csv("banklist.csv")
print(bank)

                                             Bank Name                City  \
0                                  Fayette County Bank          Saint Elmo
1    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
2                                       First NBC Bank         New Orleans
3                                        Proficio Bank  Cottonwood Heights
4                        Seaway Bank and Trust Company             Chicago
..                                                 ...                 ...
546                                 Superior Bank, FSB            Hinsdale
547                                Malta National Bank               Malta
548                    First Alliance Bank & Trust Co.          Manchester
549                  National State Bank of Metropolis          Metropolis
550                                   Bank of Honolulu            Honolulu

     ST   CERT                Acquiring Institution Closing Date Updated Date
0    IL   1802            United Fidelity Bank, fsb    26-May-17    01-Jun-17
1    WI  30003  First-Citizens Bank & Trust Company    05-May-17    01-Jun-17
2    LA  58302                         Whitney Bank    28-Apr-17    23-May-17
3    UT  35495                    Cache Valley Bank    03-Mar-17    18-May-17
4    IL  19328                  State Bank of Texas    27-Jan-17    18-May-17
..   ..    ...                                  ...          ...          ...
546  IL  32646                Superior Federal, FSB    27-Jul-01    19-Aug-14
547  OH   6629                    North Valley Bank    03-May-01    18-Nov-02
548  NH  34264  Southern New Hampshire Bank & Trust    02-Feb-01    18-Feb-03
549  IL   3815              Banterra Bank of Marion    14-Dec-00    17-Mar-05
550  HI  21029                   Bank of the Orient    13-Oct-00    17-Mar-05

[551 rows x 7 columns]

In [41]:
# 2) Show the head of the dataframe. 
import pandas as pd
data = {"Name" : ["Dimple","Stuti","Vasu","Vedu","Aaru"],
        "Age" : [33,31,25,21,15],
        "Department" : ["Account","Admin","HR","Designing","Testing"],
        "Salary" :[85000,56000,75000,65000,55000]}
df = pd.DataFrame(data)
print(df.head())

     Name  Age Department  Salary
0  Dimple   33    Account   85000
1   Stuti   31      Admin   56000
2    Vasu   25         HR   75000
3    Vedu   21  Designing   65000
4    Aaru   15    Testing   55000

In [57]:
# 3) What are the column names? 
#df = pd.DataFrame(data, columns = ["Name","Age","Gender","Department","Salary"])
bank.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

In [63]:
# 4) How many States (ST) are represented in this data set? 

bank['ST'].nunique()

44

In [67]:
# 5) Get a list or array of all the states in the data set. 

bank['ST'].unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

In [69]:
# 6) What are the top 5 states with the most failed banks? 

bank.groupby(by = 'ST').count().sort_values(by = 'Bank Name', ascending = False).iloc[:5, 1]

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: City, dtype: int64

In [71]:
# 7) What are the top 5 acquiring institutions? 

bank.groupby('Acquiring Institution').count().sort_values(by = 'City', ascending = False).iloc[:5,1]

Acquiring Institution
No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: City, dtype: int64

In [73]:
# 8) How many banks has the State Bank of Texas acquired? How many of them were actually in Texas? 

bank[(bank['Acquiring Institution'] == 'State Bank of Texas') & (bank['ST'] ==  'TX')]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,02-Jul-09,26-Oct-12

In [75]:
# 9) What is the most common city in California for a bank to fail in? 

bank[bank['ST'] == 'CA'].groupby('City').count().sort_values(by = 'ST', ascending = False).head(1)

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4